# Tech Conferences 2019-2022

In 2019, I attended my first tech conference - PyCon PL, near Warsaw.<br>
My second conference - dotPy, in Paris - was cancelled at the last minute, because of some new virus.<br>
This summer, I attended  PyData in London and Euro Python in Dublin.<br>
I collected details about the conferences, then rated them for different aspects.<br>

This notebook accompanies my lightning talk to Brighton Data Forum (Nov 22), which aims to:
- encourage more people to try one
- demonstrate the data science (linear regression) process to non specialists
- entertain seasoned data scientists with my playful treatment of a laughably small dataset<br>

I joke that, "I'll never know what I missed in Paris...But, with our secret superpowers, <b>let's find out!"</b> <br><br><br><br>

In [1]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression

In [2]:
df = pd.read_excel("tech_conferences_2019-2022.xlsx")

In [3]:
df

,name,location,travel_time,start_date,year,month,day,duration,participants,cost,friendly,vegan,inclusive,swag,talks,venue,overall
0,PyCon PL,Warsaw,120,23.8.19,2019,8,5,4.0,250,300,4,2,3,1,3,3,2.666667
1,dotPy,Paris,4,2.3.20,2020,3,2,0.5,300,100,-,-,-,-,-,-,NaN
2,PyData,London,2,18.6.22,2022,6,7,2.0,400,250,5,2,4,4,4,5,4.000000
3,Euro Python,Dublin,11,13.7.22,2022,7,4,3.0,300,80,4,3,5,4,3,5,4.000000

In [4]:
df.columns # for copy and paste

Index(['name', 'location', 'travel_time', 'start_date', 'year', 'month', 'day',
       'duration', 'participants', 'cost', 'friendly', 'vegan', 'inclusive',
       'swag', 'talks', 'venue', 'overall'],
      dtype='object')

In [5]:
df_full = df # Backup copy

In [6]:
df.drop(['name', 'location', 'start_date'], axis=1, inplace=True) # drop the non numerical features

#### Names are suffixed with combinations of the initials of Warsaw, Paris, London and Dublin

In [7]:
df_wld = df.drop(index=1, axis=0) # Drop the Paris row, because there are no ratings

In [8]:
df_wld

,travel_time,year,month,day,duration,participants,cost,friendly,vegan,inclusive,swag,talks,venue,overall
0,120,2019,8,5,4.0,250,300,4,2,3,1,3,3,2.666667
2,2,2022,6,7,2.0,400,250,5,2,4,4,4,5,4.000000
3,11,2022,7,4,3.0,300,80,4,3,5,4,3,5,4.000000

In [9]:
df_wld_features = df_wld[['travel_time', 'year', 'month', 'day', 'duration', 'participants', 'cost']]

In [10]:
df_wld_overall = df_wld[['overall']]

In [11]:
df_p = df_full.drop(index=[0,2,3], axis=0) # drop Warsaw, London, Dublin

In [12]:
df_p

,travel_time,year,month,day,duration,participants,cost,friendly,vegan,inclusive,swag,talks,venue,overall
1,4,2020,3,2,0.5,300,100,-,-,-,-,-,-,NaN

In [13]:
df_p_features = df_p[['travel_time', 'year', 'month', 'day', 'duration', 'participants', 'cost']]

In [14]:
df_p_features

   travel_time  year  month  day  duration  participants  cost
1            4  2020      3    2       0.5           300   100

In [15]:
X_train, X_test, y_train, y_test = train_test_split(df_wld_features, df_wld_overall, test_size=0.33, random_state=0)

In [16]:
lm_wld = LinearRegression()

In [17]:
lm_wld.fit (X_train,y_train) # fitting means plotting + 'line of best fit'

LinearRegression()

In [18]:
predictions = lm_wld.predict(X_test)

In [19]:
predictions

array([[3.74076261]])

Prediction: 3.74     Actual: 4     Not bad!

In [20]:
paris_prediction = lm_wld.predict(df_p_features)

In [21]:
print ('Paris would have had an overall rating of: ', paris_prediction[0,0])

Paris would have had an overall rating of:  3.734908203877262